## PANDAS에서 제공한는 대표적인 자료구조

+ 1) Series
    - 값 + index

+ 2) DataFrame
    - 여러개의 Series를 묶어놓은 형태

+ 3) https://pandas.pydata.org

In [1]:
import pandas as pd
import numpy as np

### 1. Series

In [2]:
s = pd.Series([9904312, 3448737, 2890451, 2466052])
print(s)
print(type(s))

0    9904312
1    3448737
2    2890451
3    2466052
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
for i in enumerate([9904312, 3448737, 2890451, 2466052]):
    print(i)

(0, 9904312)
(1, 3448737)
(2, 2890451)
(3, 2466052)

In [4]:
#### 인덱스를 자유롭게 지정

s = pd.Series([9904312, 3448737, 2890451, 2466052], index=['서울','부산','인천','대구'])
print(s)

print('--------------------------------------------')

print(s.values, type(s.values))
print(s.index)

print('--------------------------------------------')

# 인덱스에 이름 지정
s.index.name = '도시'
print(s)

print('-------------------------------------------')

# Series전체에 이름 지정
s.name = '인구'
print(s)

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
--------------------------------------------
[9904312 3448737 2890451 2466052] <class 'numpy.ndarray'>
Index(['서울', '부산', '인천', '대구'], dtype='object')
--------------------------------------------
도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
-------------------------------------------
도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [5]:
##### 벡터화 연산

s1 = s/ 1000000
print(s1)

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [6]:
##### 인덱싱

print(s[1], s['부산'])

print('----------------------------')

print(s[[0,3,1]])

print('----------------------------')

print(s[(s>250e4)&(s<500e4)])
print(s[(s>500)&(s<1000)])

print('----------------------------')

print(s[1:3])
print(s['부산':'대구'])

print('------------------------------')
print(s.부산,',',s.서울)

3448737 3448737
----------------------------
도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64
----------------------------
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
Series([], Name: 인구, dtype: int64)
----------------------------
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64
------------------------------
3448737 , 9904312

In [7]:
##### Series 와 dict

print('서울' in s)
print('대전' in s)

print('-----------------------------------')

print(list(s.items()))
for k,v in s.items():
    print('%s = %d'%(k,v))
    
print('----------------------------------')

s2 = pd.Series({'s' : 111111,'d' : 222222, 'b': 333333, 'f' : 555555})
print(s2)

True
False
-----------------------------------
[('서울', 9904312), ('부산', 3448737), ('인천', 2890451), ('대구', 2466052)]
서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052
----------------------------------
s    111111
d    222222
b    333333
f    555555
dtype: int64

In [8]:
##### 인덱스 기반 연산

print(s)
print('--------------------------')
print(s2)
print('--------------------------')
result = s-s2
print(result)
print('---------------------------')
print(s.values - s2.values)

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64
--------------------------
s    111111
d    222222
b    333333
f    555555
dtype: int64
--------------------------
b    NaN
d    NaN
f    NaN
s    NaN
대구   NaN
부산   NaN
서울   NaN
인천   NaN
dtype: float64
---------------------------
[9793201 3226515 2557118 1910497]

In [9]:
##### 결측치 제거

print(result)
print(result.notnull())

print(result[result.notnull()])
print('------------------------------------')
# s와 s2 데이터를 이용해서 인구 증가율 : (끝 연도 - 시작연도) / 시작연도 * 100

ratio = (s2-s)/ s*100
ratio2 = ratio[ratio.notnull()]
print(ratio2)

b    NaN
d    NaN
f    NaN
s    NaN
대구   NaN
부산   NaN
서울   NaN
인천   NaN
dtype: float64
b     False
d     False
f     False
s     False
대구    False
부산    False
서울    False
인천    False
dtype: bool
Series([], dtype: float64)
------------------------------------
Series([], dtype: float64)

In [11]:
##### 데이터를 수정, 삭제, 갱신

ratio2['부산'] = 1.63 # 수정
print(ratio2)

ratio2['대구'] = 1.41 # 갱신
print(ratio2)

del ratio2['부산'] # 삭제
print(ratio2)

부산    1.63
대구    1.41
dtype: float64
부산    1.63
대구    1.41
dtype: float64
대구    1.41
dtype: float64

### 2. DataFrame

In [14]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

In [15]:
print(type(data))

<class 'dict'>

In [16]:
df = pd.DataFrame(data)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

      2015     2010     2005     2000   지역  2010-2015 증가율
0  9904312  9631482  9762546  9853972  수도권         0.0283
1  3448737  3393191  3512547  3655437  경상권         0.0163
2  2890451  2632035  2517680  2466338  수도권         0.0982
3  2466052  2431774  2456016  2473990  경상권         0.0141

#### 1) 컬럼의 위치(순서) 바꾸기

In [17]:
cols = ['지역','2015','2010','2005','2000','2010-2015 증가율']

df = pd.DataFrame(data, columns=cols)
df

    지역     2015     2010     2005     2000  2010-2015 증가율
0  수도권  9904312  9631482  9762546  9853972         0.0283
1  경상권  3448737  3393191  3512547  3655437         0.0163
2  수도권  2890451  2632035  2517680  2466338         0.0982
3  경상권  2466052  2431774  2456016  2473990         0.0141

#### 2) 인덱스 변경

In [18]:
idx = ['서울','부산','인천','대구']

df = pd.DataFrame(data, columns=cols, index = idx)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [19]:
print(df.values)
print(df.columns)
print(df.index)

[['수도권' 9904312 9631482 9762546 9853972 0.0283]
 ['경상권' 3448737 3393191 3512547 3655437 0.0163]
 ['수도권' 2890451 2632035 2517680 2466338 0.0982]
 ['경상권' 2466052 2431774 2456016 2473990 0.0141]]
Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')
Index(['서울', '부산', '인천', '대구'], dtype='object')

In [20]:
##### 컬럼과 인덱스에 이름 부여

df.index.name = '도시'
df.columns.name = '특성'
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [69]:
##### 전치 기능
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

#### 3) 인덱싱

In [76]:
print(df)
print('--------------------------------------')

print(df['지역'])
print(type(df['지역']))

print('--------------------------------------')

print(df[['지역']])
print(type(df[['지역']]))

print('-------------------------------------')

print(df[['2010','2005']])
print(type(df[['2010','2005']]))

# df[0] : 숫자로 지정 안됨
# df[:] : 슬라이싱 안됨

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141
--------------------------------------
도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object
<class 'pandas.core.series.Series'>
--------------------------------------
특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권
<class 'pandas.core.frame.DataFrame'>
-------------------------------------
특성     2010     2005
도시
서울  9631482  9762546
부산  3393191  3512547
인천  2632035  2517680
대구  2431774  2456016
<class 'pandas.core.frame.DataFrame'>

In [80]:
##### 행 인덱싱 (반드시 : 으로 슬라이싱)

print(df[:])
print('-------------------------------------------')
print(df[:1])
print('-------------------------------------------')
print(df[1:3])
print('-------------------------------------------')
print(df['서울':'부산'])

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141
-------------------------------------------
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
-------------------------------------------
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
-------------------------------------------
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163

In [39]:
##### 동시에 행과 열에 접근

df['2005']['서울']
# df['2005','서울']이건 안됨
print('----------------------------------')
print(df[['2005','2010']][:'서울'])

----------------------------------
특성     2005     2010
도시
서울  9762546  9631482

### 4) 열 데이터 갱신, 추가, 삭제

In [40]:
# 갱신
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

# 추가
df['2005-2010 증강율'] = ((df['2010']-df['2005'])/df['2005']*100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증강율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

### 5) 실습1

In [42]:
data = {
    '국어':[80,90,70,30],
    '영어':[90,70,60,40],
    '수학':[90,60,80,70]
}

In [45]:
##### 1. 인덱스를 춘향, 몽룡, 향단, 방자로 구성된 데이터 프레임 df를 작성

df = pd.DataFrame(data,index=['춘향','몽룡','향단','방자'])
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [46]:
##### 2. 모든 학생의 수학점수를 조회

df[['수학']]

    수학
춘향  90
몽룡  60
향단  80
방자  70

In [47]:
##### 3. 모든 학생의 국어와 영어 점수를 조회

df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [48]:
##### 4. 모든 학생의 각 괴목평균 점수룰 새로운 열(과목평균)로 추가하시오.

df['과목평균'] = ((df['국어']+df['영어']+df['수학'])/3).round(2)
df

    국어  영어  수학   과목평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [52]:
##### 5. 방자의 영어점수를 80점으로 수정하고 평균 점수도 다시 수정하시오.

#1
df['영어']['방자'] = 80
df

df['과목평균(수정)']=  ((df['국어']+df['영어']+df['수학'])/3).round(2)
df

#2
df['과목평균']['방자'] = df[['국어','영어','수학']]['방자':'방자'].mean(axis=1)

<ipython-input-52-922b40bc672c>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어']['방자'] = 80

    국어  영어  수학   과목평균  과목평균(수정)
춘향  80  90  90  86.67     86.67
몽룡  90  70  60  73.33     73.33
향단  70  60  80  70.00     70.00
방자  30  80  70  46.67     60.00

In [50]:
##### 6. 춘향의 점수를 데이터 프레임 형식으로 출력하시오

print(type(df[:'춘향']))
df[:'춘향']

<class 'pandas.core.frame.DataFrame'>

    국어  영어  수학   과목평균
춘향  80  90  90  86.67

In [56]:
##### 7. 향단의 점수를 series로 출력하시오. 

#1
df_T=df.T
print(type(df_T['향단']))
df_T['향단']

#2
a = pd.Series([i for i in df['향단':'향단'].values],index=['향단'])
print(type(a))
a

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

향단    [70.0, 60.0, 80.0, 70.0, 70.0]
dtype: object

### 6) 파일 입출력

+ read_csv()
+ to_csv()
+ read_table()

In [57]:
%%writefile data/sample.csv

c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting data/sample.csv

In [5]:
import pandas as pd
import numpy as np
sample = pd.read_csv('data/sample.csv')
sample

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [6]:
%%writefile data/sample2.csv

1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing data/sample2.csv

In [8]:
sample2 = pd.read_csv('data/sample2.csv', names = ['c1','c2','c3'])
sample2

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [9]:
# 특정힌 열을 인덱스로 지정
sample3 = pd.read_csv('data/sample.csv',index_col = 'c1')
sample3

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [10]:
%%writefile data/sample3.txt
c1    c2    c3    c4
0.23  0.33  0.354 0.2389
0.123 0.345 0.567 0.986

Writing data/sample3.txt

In [13]:
sample3 = pd.read_table('data/sample3.txt',sep='\s+')
sample3

      c1     c2     c3      c4
0  0.230  0.330  0.354  0.2389
1  0.123  0.345  0.567  0.9860

In [14]:
%%writefile data/sample4.txt
파일제목 : sample4.txt
데이터 포맷의 설명 : 블라블라
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing data/sample4.txt

In [17]:
#sample4 = pd.read_table('data/sample4.txt',skiprows=[0,1])
sample4 = pd.read_table('data/sample4.txt',skiprows=2)
sample4

       c1, c2, c3
0    1, 1.11, one
1    2, 2.22, two
2  3, 3.33, three

In [27]:
%%writefile data/sample5.csv

c1, c2, c3
1, 1.11, 
2, , two
누락, 3.33, three

Overwriting data/sample5.csv

In [30]:
sample5 = pd.read_csv('data/sample5.csv', na_values=[" ","누락"])
sample5

    c1    c2      c3
0  1.0  1.11     NaN
1  2.0   NaN     two
2  NaN  3.33   three

In [31]:
# csv로 저장

df.to_csv('data/sample6.csv')
df.to_csv('data/sample7.txt',sep='|')
df.to_csv('data/sample8.csv',index=False,header = False)
sample5.to_csv('data/sample9.txt',sep=':',na_rep='누락')

### 7) Indexer

+ loc : 라벨값 기반의 2차원 인덱싱을 지원하는 인덱서
+ iloc : 순서를 나타내는 정수기반의 인덱서
+ ix
+ at
+ iat

##### -loc

In [3]:
df = pd.DataFrame(np.arange(10,22).reshape(3,4),index=['a','b','c'],
                 columns=['A','B','C','D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [5]:
##### 첫번째 행 추출

print(df[:1])
print(df[:'a'])

print('------------------------------------')

print(df.loc['a'])

print('------------------------------------')

df.loc[df.A > 15]

print('------------------------------------')

def select_row(df,num):
    return df.A > num

print(df.loc[select_row(df,15)])

    A   B   C   D
a  10  11  12  13
    A   B   C   D
a  10  11  12  13
------------------------------------
A    10
B    11
C    12
D    13
Name: a, dtype: int32
------------------------------------
------------------------------------
    A   B   C   D
c  18  19  20  21

In [6]:
##### 행과 열을 모두 사용할 경우

# a행 A열에 있는 하나의 값을 추출
print(df['A']['a'])
print(df.loc['a']['A'])
print(df.loc['a','A'])

print('---------------------------------')

print(df.loc['b':,'B':])
print(df.loc[['a','c'],['B','C']])

print('---------------------------------')

# 모든 행에 대해서 첫번째 행에 있는 값이 11보다 작거나 같은 행의 컬럼을 조회
print(df.loc['a':,['A','B']])
print(df.loc[:,df.loc['a',:]<=11])

10
10
10
---------------------------------
    B   C   D
b  15  16  17
c  19  20  21
    B   C
a  11  12
c  19  20
---------------------------------
    A   B
a  10  11
b  14  15
c  18  19
    A   B
a  10  11
b  14  15
c  18  19

In [7]:
# 반드시 레이블로만 접근 해야한다.

# print(df.loc[1:,1:1])
# print(df.loc[[0,2],[1,2]])

-iloc

In [8]:
print(df['A'])
#df[0]

print('---------------------')

#df.loc[0,0]
print(df.loc['a',"A"])

print('---------------------')

print(df.iloc[0,0])
print(df.iloc[:2,2])

print('---------------------')

print(df.iloc[2:3,1:3])
print(df.iloc[[2],1:3])
print(df.iloc[2:,1:3])
print(pd.DataFrame(df.iloc[2,1:3]).T)

a    10
b    14
c    18
Name: A, dtype: int32
---------------------
10
---------------------
10
a    12
b    16
Name: C, dtype: int32
---------------------
    B   C
c  19  20
    B   C
c  19  20
    B   C
c  19  20
    B   C
c  19  20

#### -at

In [9]:
%timeit df.loc['a','A']
%timeit df.at['a','A']

6.84 µs ± 555 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)
4.13 µs ± 231 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

----

### 3.Data Manipulation

#### 1) 데이터의 갯수 세기

In [10]:
##### Series에서 갯수 세기

s = pd.Series(range(10))
s
s[3] = np.nan
print(s.count())
print(len(s))

9
10

In [11]:
##### DataFrame에서 갯수 세기

np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4,4)),dtype=float)
print(df)
df.count()

df.iloc[2,3] = np.nan
df.count()

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  4.0
3  4.0  3.0  4.0  2.0

0    4
1    4
2    4
3    3
dtype: int64

In [12]:
##### titanic

import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

#### 2) 카테고리별 갯수 세기

In [34]:
np.random.seed(1)

s2 = pd.Series(np.random.randint(6, size=100))
print(s2)

s2.value_counts()

# DataFrame에서 사용시
print(df[1].value_counts())
print(df)

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32
0.0    2
3.0    1
2.0    1
Name: 1, dtype: int64
     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

#### 3) 정렬

    + sort_index()
    + sort_values()
    + 결측치는 정렬의 대상이 되지 않는다.

In [37]:
# Series를 이용한 정렬

np.random.seed(1)
s = pd.Series(np.random.randint(6, size=100))

s.value_counts().sort_values()
s.value_counts().sort_index()
s.sort_values()
s.sort_values(ascending=False)

0     5
11    5
46    5
40    5
71    5
     ..
28    0
85    0
39    0
38    0
57    0
Length: 100, dtype: int32

In [123]:
# DataFrame을 이용한 정렬

np.random.seed(2)
df = pd.DataFrame(np.random.randint(5,size=(4,4)),dtype=float)
print(df)
print('----------------------')

df.sort_values(by=3)
print(df.sort_values(by=[1,3]))
print('----------------------')

df1 = pd.DataFrame({
    'seq':[1,3,2], 'name':['park','lee','choi'], 'age':[30,20,40]
})
print(df1)

# seq를 기준으로 정렬(내림차순)
print(df1.sort_values(by='seq',ascending=False,axis=0))

# index를 기준으로 정렬
df1.sort_index(axis=0)
df1.sort_index(axis=1)
print(df1.sort_index(axis=0, ascending=False))

# inplace
df1_2 = df1.sort_index(axis=1)
print(df1_2)

df1_2.sort_values(by=['seq','name'], ascending=False, inplace=True)
print(df1_2)
print('----------------------')

#### 결측치 위치 선정

df2 = pd.DataFrame({
    "seq":[1, np.nan, 2], "name":["park", "lee", "choi"], "age":[30, 20, 40]
})
df2
df2.sort_values(by='seq')
print(df2.sort_values(by='seq', na_position='first'))

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  4.0
3  4.0  3.0  4.0  2.0
----------------------
     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  4.0
3  4.0  3.0  4.0  2.0
----------------------
   seq  name  age
0    1  park   30
1    3   lee   20
2    2  choi   40
   seq  name  age
1    3   lee   20
2    2  choi   40
0    1  park   30
   seq  name  age
2    2  choi   40
1    3   lee   20
0    1  park   30
   age  name  seq
0   30  park    1
1   20   lee    3
2   40  choi    2
   age  name  seq
1   20   lee    3
2   40  choi    2
0   30  park    1
----------------------
   seq  name  age
1  NaN   lee   20
0  1.0  park   30
2  2.0  choi   40

#### 4) 행,열의 합계(평균,...)

In [91]:
import numpy as np
import pandas as pd
np.random.seed(1)
df = pd.DataFrame(np.random.randint(10,size=(4,8)))
print(df)

print('--------------------------------------')

df.sum()
df.sum(axis=0)

df.loc['ColSum',:] = df.sum()
print(df)
df['RowSum'] = df.sum(axis=1)
print(df)

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1
--------------------------------------
           0     1     2     3     4     5    6     7
0        5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0
1        6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0
2        4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0
3        9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0
ColSum  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0
           0     1     2     3     4     5    6     7  RowSum
0        5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0    35.0
1        6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0    34.0
2        4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0    41.0
3        9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0    42.0
ColSum  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0   152.0

#### 5) apply()

+ 행이나 열 단위로 더 복잡한 처리를 하고자 할 때 서용
+ 인수로 행 또는 열을 받는 함수를 apply()의 인수로 넣으면 각 열(또는 행)을 반복하여 그 함수에 적용

In [16]:
df = pd.DataFrame({
    'A':[1,3,4,3,4],
    'B':[2,3,1,2,3],
    'C':[1,5,2,4,4]
})
df

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [22]:
##### 각 열(행)별로 최대값에서 최소값을 뺸 값을 구하고자 한다.

def diff(x):
    return x.max() - x.min()

print(diff(df['A']))
print(diff(df['B']))
print(diff(df['C']))
print('------------------------------------')

print(df.apply(diff,axis=0))
print(df.apply(diff,axis=1))

df.loc['Clow',:]=df.apply(diff,axis=0)
df

3.0
2.0
4.0
------------------------------------
A    3.0
B    2.0
C    4.0
dtype: float64
0       1.0
1       2.0
2       3.0
3       2.0
4       1.0
Clow    2.0
dtype: float64

        A    B    C
0     1.0  2.0  1.0
1     3.0  3.0  5.0
2     4.0  1.0  2.0
3     3.0  2.0  4.0
4     4.0  3.0  4.0
Clow  3.0  2.0  4.0

In [24]:
##### 람다 함수

df.apply(lambda x : x.max()-x.min(),axis=0)

A    3.0
B    2.0
C    4.0
dtype: float64

In [26]:
##### 각 열에 대해 어떤 값이 얼마나 사용되었는지 조회 : value_counts()

print(df['A'].value_counts())
print(df['B'].value_counts())
print(df['C'].value_counts())

print('------------------------------')

df.apply(pd.value_counts,axis=0).fillna(0)

3.0    3
4.0    2
1.0    1
Name: A, dtype: int64
2.0    3
3.0    2
1.0    1
Name: B, dtype: int64
4.0    3
2.0    1
5.0    1
1.0    1
Name: C, dtype: int64
------------------------------

       A    B    C
1.0  1.0  1.0  1.0
2.0  0.0  3.0  1.0
3.0  3.0  2.0  0.0
4.0  2.0  0.0  3.0
5.0  0.0  0.0  1.0

#### 6) 실수값을 카테고리로 변경(양적데이터 -> 질적데이터) 

+ cut()
+ qcut()

In [29]:
# 1~15 : 미성년자, 16~25 : 청년. 26~35 : 중년, 36~60 : 장년, 61~99 : 노년

ages = [0,2,10,21,23,37,31,61,20,41,32,100]

cat = pd.cut(x=ages, bins=[1,15,25,35,60,99],
      labels = ['미자','청년','중년','장년','노년'])
print(cat)

[NaN, '미자', '미자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미자' < '청년' < '중년' < '장년' < '노년']

In [30]:
print(type(cat))
print(cat.categories)
print(cat.codes)

<class 'pandas.core.arrays.categorical.Categorical'>
Index(['미자', '청년', '중년', '장년', '노년'], dtype='object')
[-1  0  0  1  1  3  2  4  1  3  2 -1]

In [35]:
df = pd.DataFrame(ages, columns=['ages'])
df

df['age_cat'] = cat
df

df['age_cat_num'] = cat.codes
df

    ages age_cat  age_cat_num
0      0     NaN           -1
1      2      미자            0
2     10      미자            0
3     21      청년            1
4     23      청년            1
5     37      장년            3
6     31      중년            2
7     61      노년            4
8     20      청년            1
9     41      장년            3
10    32      중년            2
11   100     NaN           -1

In [40]:
##### qcut()

data = np.random.randn(100)
cat1 = pd.qcut(data,4,labels=['Q1','Q2','Q3','Q4'])
cat1
pd.value_counts(cat1)

Q4    25
Q3    25
Q2    25
Q1    25
dtype: int64

---
### 4. Index Manipulation

#### 1) set_index(), reset_index()

In [49]:
np.random.seed(0)

df1 = pd.DataFrame(np.vstack([list('ABCDE'),np.round(np.random.rand(3,5))]).T,
            columns=['c1','c2','c3','c4'])
df1

  c1   c2   c3   c4
0  A  1.0  1.0  1.0
1  B  1.0  0.0  1.0
2  C  1.0  1.0  1.0
3  D  1.0  1.0  1.0
4  E  0.0  0.0  0.0

In [51]:
df2 = df1.set_index('c1')
df2

     c2   c3   c4
c1
A   1.0  1.0  1.0
B   1.0  0.0  1.0
C   1.0  1.0  1.0
D   1.0  1.0  1.0
E   0.0  0.0  0.0

In [55]:
df2.set_index('c2')

      c3   c4
c2
1.0  1.0  1.0
1.0  0.0  1.0
1.0  1.0  1.0
1.0  1.0  1.0
0.0  0.0  0.0

In [59]:
# df2.reset_index()
df2.reset_index(drop=True)

    c2   c3   c4
0  1.0  1.0  1.0
1  1.0  0.0  1.0
2  1.0  1.0  1.0
3  1.0  1.0  1.0
4  0.0  0.0  0.0

#### 2) 다중 인덱스 조작

In [62]:
np.random.seed(0)

df2 = pd.DataFrame(np.vstack([list('ABCDE'),np.round(np.random.rand(3,5))]).T,
            columns=[['A','A','B','B'],['c1','c2','c1','c2']])
df2

df2.columns.names = ['Cidx1','Cidx2']
df2

Cidx1  A         B
Cidx2 c1   c2   c1   c2
0      A  1.0  1.0  1.0
1      B  1.0  0.0  1.0
2      C  1.0  1.0  1.0
3      D  1.0  1.0  1.0
4      E  0.0  0.0  0.0

In [75]:
# 인덱싱

df2[('A','c1')]
df2[('B','c1')]

df2[('B','c1')][0]
df2[('B','c1')][0:]

df2.loc[0,('B','c1')]
df2.loc[:,('B','c1')]

print(df2.iloc[0:,0])

0    A
1    B
2    C
3    D
4    E
Name: (A, c1), dtype: object

In [10]:
##### 다중 컬럼과 다중 인덱스

df3 = pd.DataFrame(np.round(np.random.rand(6,4),2),
                   
                           columns = [['A','A,'B','B'],['C','D','C','D']],
                           index = [['M','M','M','F','F','F'],
                           ['id_' + str(i+1) for i in range(3)]*2] )
df3
                              
df3.columns.names = ['Cidx1','Cidx1']

SyntaxError: invalid syntax (<ipython-input-10-3ec13807875e>, line 5)

In [86]:
##### 행인덱스와 열 인덱스의 교한: stack() - 열을 행으로 , unstack() - 행을 열로

print(df3.T)

print('---------------------')

df3.stack('Cidx1')
df3.stack(1)

df3.unstack('Ridx1')
df3.unstack(1)

      0     1     2     3     4     5
0  0.09  0.67  0.18  0.00  0.96  0.57
1  0.58  0.13  0.59  0.68  0.25  0.22
2  0.93  0.72  0.02  0.27  0.58  0.95
3  0.32  0.29  0.83  0.74  0.59  0.45
---------------------

KeyError: 'Requested level (Cidx1) does not match index name (None)'

In [87]:
##### 인덱싱

print(df3)
print('------------------------------------')

# 첫번째 행과 첫번쨰 열에 있는 0.24값을 출력
df3.loc[('M','id_1'), ('A',"C")]

# 첫번쨰 열에 있는 0.24~0.43까지 출력
df3.iloc[:5,0]

# 첫번째 행의 모든 컬럼값들을 출력
df3.loc[('M','id_1'),:]

# 맨 마지막 행에 'ALL'이라는 인덱스를 추가하여 각 열의 합을 출력
df3.loc[('ALL','ALL'),:] = df3.sum() # 1번
df3.loc['ALL', : ] = df3.sum(axis=0).tolist() # 2번

      0     1     2     3
0  0.09  0.58  0.93  0.32
1  0.67  0.13  0.72  0.29
2  0.18  0.59  0.02  0.83
3  0.00  0.68  0.27  0.74
4  0.96  0.25  0.58  0.59
5  0.57  0.22  0.95  0.45
------------------------------------

In [92]:
##### 순서 교환 : swaplevel(i, j, axis=0)

df4 = df3.swaplevel('Ridx1','Ridx2')
df4

df5 = df3.swaplevel('Cidx1','Cidx2', axis=1)
df5

TypeError: Can only swap levels on a hierarchical axis.

In [93]:
##### 정렬 : sort_index(level)

print(df3)
print('--------------------------')

df3.sort_index(level=0)
df3.sort_index(level=0,axis=0)
df3.sort_index(level=1)
df3.sort_index(level=0,axis=1)
df3.sort_index(level=1,axis=1)

      0     1     2     3
0  0.09  0.58  0.93  0.32
1  0.67  0.13  0.72  0.29
2  0.18  0.59  0.02  0.83
3  0.00  0.68  0.27  0.74
4  0.96  0.25  0.58  0.59
5  0.57  0.22  0.95  0.45
--------------------------

      0     1     2     3
0  0.09  0.58  0.93  0.32
1  0.67  0.13  0.72  0.29
2  0.18  0.59  0.02  0.83
3  0.00  0.68  0.27  0.74
4  0.96  0.25  0.58  0.59
5  0.57  0.22  0.95  0.45

#### 3) 실습

In [94]:
df_score1 = pd.DataFrame({
    "반":["A", "A", "B", "A", "B", "B", "B", "A", "B", "A"],
    "번호" : [1, 2, 1, 3, 2, 3, 4, 4, 5, 5],
    "국어" : [79, 67, 88, 68, 92, 54, 67, 88, 97, 85],
    "영어" : [55, 77, 44, 67, 86, 45, 78, 58, 90, 67],
    "수학" : [57, 45, 76, 68, 89, 67, 99, 78, 89, 90]
})
df_score1

   반  번호  국어  영어  수학
0  A   1  79  55  57
1  A   2  67  77  45
2  B   1  88  44  76
3  A   3  68  67  68
4  B   2  92  86  89
5  B   3  54  45  67
6  B   4  67  78  99
7  A   4  88  58  78
8  B   5  97  90  89
9  A   5  85  67  90

In [95]:
##### 1. 1차 행 인덱스로 '반'을 2차열 인덱스로 '번호'를 가지는 데이터 프레임 작성

In [96]:
##### 2. 학생의 평균을 나타내는 행을 오른쪽에 추가

In [97]:
##### 3. 행 인덱스로 '번호'를 1차 열 인덱스로 '국어','영어','수학'을 2차열 인덱스로 '반'을 가지는 데이터 프레임 작성

In [98]:
##### 4. 각 반별 각 과목의 평균을 나타내는 행을 아래에 추가

---
### 5. 데이터 프레임 합성(병합)

+ merge()
    - 두 데이터 프레임의 공통 열 또는 인덱스를 기준으로 두 개의 테이블을 합친다.
    - 이 때 기준이 되는 열, 행의 데이터를 key라고 한다.
    
+ concat()
    - 기준열을 사용하지 않고 단순히 데이터를 연결

#### 1) merge()

In [99]:
df1 = pd.DataFrame({
    "고객번호":[1001, 1002, 1003, 1004, 1005, 1006, 1007],
    "이름":["둘리", "도우너", "또치", "길동", "희동", "마이콜", "영희"]
})
print(df1)

df2 = pd.DataFrame({
    "고객번호":[1001, 1001, 1005, 1006, 1008, 1001],
    "금액":[10000, 20000, 15000, 5000, 100000, 30000]
})
print(df2)

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희
   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [105]:
pd.merge(df1,df2) # inner join
print(pd.merge(df1,df2,how='left'))
print('--------------------')
print(pd.merge(df1,df2,how='right'))
print('--------------------')
print(pd.merge(df1,df2,how='outer'))

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN
--------------------
   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리   30000
3  1005   희동   15000
4  1006  마이콜    5000
5  1008  NaN  100000
--------------------
   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [110]:
##### 키가 여러 개인 경우

df1 = pd.DataFrame({
    "고객명":["춘향", "춘향", "몽룡"],
    "날짜":["2019-01-01", "2019-01-02", "2019-01-03"], 
    "데이터":["20000", "30000", "100000"]
})

df2 = pd.DataFrame({
    "고객명":["춘향", "몽룡"],
    "데이터":["여자", "남자"]
})

print(df1)
print(df2)

print('--------------------------------')

pd.merge(df1,df2, on='고객명')

  고객명          날짜     데이터
0  춘향  2019-01-01   20000
1  춘향  2019-01-02   30000
2  몽룡  2019-01-03  100000
  고객명 데이터
0  춘향  여자
1  몽룡  남자
--------------------------------

  고객명          날짜   데이터_x 데이터_y
0  춘향  2019-01-01   20000    여자
1  춘향  2019-01-02   30000    여자
2  몽룡  2019-01-03  100000    남자

In [119]:
##### 공통된 키가 없는 경우

df1 = pd.DataFrame({
    "이름":["영희", "철수", "철수"],
    "성적":[1, 2, 3]
})

df2 = pd.DataFrame({
    "성명":["영희", "영희", "철수"],
    "점수":[4, 5, 6]
})

pd.merge(df1, df2, left_on='이름', right_on='성명')

   이름  성적  성명  점수
0  영희   1  영희   4
1  영희   1  영희   5
2  철수   2  철수   6
3  철수   3  철수   6

In [122]:
##### 인덱스를 기준 열로 사용하는 경우(한쪽은 컬럼, 한쪽은 인덱스)

df1 = pd.DataFrame({
    '도시': ['서울', '서울', '서울', '부산', '부산'],
    '연도': [2000, 2005, 2010, 2000, 2005],
    '인구': [9853972, 9762546, 9631482, 3655437, 3512547]})
print(df1)
print("------------------------------")


df2 = pd.DataFrame(
    np.arange(12).reshape((6, 2)),
    index=[['부산', '부산', '서울', '서울', '서울', '서울'],
           [2000, 2005, 2000, 2005, 2010, 2015]],
    columns=['데이터1', '데이터2'])
print(df2)
print("------------------------------")
df2

print('--------------------------------------------')

pd.merge(df1,df2,left_on=['도시','연도'], right_index=True)

   도시    연도       인구
0  서울  2000  9853972
1  서울  2005  9762546
2  서울  2010  9631482
3  부산  2000  3655437
4  부산  2005  3512547
------------------------------
         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11
------------------------------
--------------------------------------------

   도시    연도       인구  데이터1  데이터2
0  서울  2000  9853972     4     5
1  서울  2005  9762546     6     7
2  서울  2010  9631482     8     9
3  부산  2000  3655437     0     1
4  부산  2005  3512547     2     3

In [131]:
##### 인덱스를 기준 열로 사용하는 경우(둘 다 인덱스인 경우)

df1 = pd.DataFrame(
    [[1., 2.], [3., 4.], [5., 6.]],
    index=['a', 'c', 'e'],
    columns=['서울', '부산'])
print(df1)
print("------------------------------")


df2 = pd.DataFrame(
    [[7., 8.], [9., 10.], [11., 12.], [13, 14]],
    index=['b', 'c', 'd', 'e'],
    columns=['대구', '광주'])
print(df2)
print("------------------------------")

pd.merge(df1,df2,left_index=True,right_index=True)
pd.merge(df1,df2,left_index=True,right_index=True, how='outer')

print(pd.concat([df1,df2]))
# merge 대신에 join() 사용가능
df1.join(df2, how='outer')

    서울   부산
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0
------------------------------
     대구    광주
b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0
------------------------------
    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
c  3.0  4.0   NaN   NaN
e  5.0  6.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  NaN  NaN   9.0  10.0
d  NaN  NaN  11.0  12.0
e  NaN  NaN  13.0  14.0

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

#### 2) concat()

In [128]:
##### Series에서 사용

s1 = pd.Series([0,1], index=['A','B'])
s2 = pd.Series([2,3,4], index=['A','B','C'])

print(s1)
print(s2)
print('----------------------------------')

pd.concat([s1,s2])

A    0
B    1
dtype: int64
A    2
B    3
C    4
dtype: int64
----------------------------------

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [136]:
##### DataFrame에서 사용

df1 = pd.DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['데이터1', '데이터2'])

print(df1)

print("-------------------------------------")

df2 = pd.DataFrame(
    5 + np.arange(4).reshape(2, 2),
    index=['a', 'c'],
    columns=['데이터3', '데이터4'])

print(df2)

print("-------------------------------------")

pd.concat([df1,df2],axis=1)

   데이터1  데이터2
a     0     1
b     2     3
c     4     5
-------------------------------------
   데이터3  데이터4
a     5     6
c     7     8
-------------------------------------

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

---
### 6. 피봇 테이블과 그룹 분석

+ pivot()
    + DataFrame.pivot(index=None, columns=None, values=None)

+ groupby()
    + DataFrame.groupby(by=None, axis=0, level=None, as_index=True, 
    sort=True, group_keys=True, squeeze=`<object object>`, 
    observed=False, dropna=True)
+ pivot_table()
    + DataFrame.pivot_table(values=None, index=None, columns=None, 
    aggfunc='mean', fill_value=None, margins=False, dropna=True, 
    margins_name='All', observed=False)

#### 1) pivot()

In [139]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}

df = pd.DataFrame(data)
df

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [25]:
##### 각 도시에서 연도별로 인구 수를 알고싶다.
#df.pivot(index='도시', columns='연도', values='인구')
df2=df.pivot_table('인구','도시','연도',fill_value=0).sum()
df2

연도
2005    13275093
2010    13287876
2015    16243500
dtype: int64

#### 2) groupby()

+ 반드시 집계함수와 같이 사용
    + size(), count()
    + mean(), median(), min(), max()
    + sum(), prod(), std(), var(), quantile()
    + first(), last()
    + agg(), aggregate()
    + describe()
    + apply()
    + transform()

In [149]:
df2 = pd.DataFrame({
    "key1":["A", "A", "B", "B", "A"],
    "key2":["one", "two", "one", "two", "one"],
    "data1":[1, 2, 3, 4, 5],
    "data2":[10, 20, 30, 40, 50]
})

df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [148]:
g = df2.groupby(by='key1')
g
g.sum()

      data1  data2
key1
A         8     80
B         7     70

In [169]:
##### 다양한 사용 방법

print(df2.groupby('key1').sum())
print('------------------------')
print(df2.data1.groupby(df2.key1).sum())
print(df2.groupby('key1')['data1'].sum())
print('------------------------')
print(df2.groupby('key1').sum()['data1'])
print('------------------------')
print(df2.groupby('key1').sum()[['data1']])

      data1  data2
key1
A         8     80
B         7     70
------------------------
key1
A    8
B    7
Name: data1, dtype: int64
key1
A    8
B    7
Name: data1, dtype: int64
------------------------
key1
A    8
B    7
Name: data1, dtype: int64
------------------------
      data1
key1
A         8
B         7

In [182]:
##### 복합 키

df2.data1.groupby([df2.key1,df2.key2]).sum()
df2.data1.groupby([df2.key1,df2.key2]).sum().unstack()

# df를 이용해서 각 도시에서 연도별로 인구수를 조회
df.groupby([df.도시,df.연도]).sum().unstack()

df.groupby(['도시','연도']).sum().unstack()

# 지역별 힙계
'''
연도 2005 2010 2015
지역
경상권 ...
수도권 ...
'''

df.groupby(['지역','연도']).sum().unstack()

          인구
연도      2005     2010      2015
지역
경상권  3512547  3393191   3448737
수도권  9762546  9894685  12794763

In [183]:
##### apply, agg, transform

import seaborn as sns
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [190]:
def test(x):
    return 1

##########################

g = iris.groupby('species')

print(g.apply(test))
print('-------------------------')
print(g.agg(test))
print('-------------------------')
print(g.transform(test))

species
setosa        1
versicolor    1
virginica     1
dtype: int64
-------------------------
            sepal_length  sepal_width  petal_length  petal_width
species
setosa               1.0          1.0           1.0          1.0
versicolor           1.0          1.0           1.0          1.0
virginica            1.0          1.0           1.0          1.0
-------------------------
     sepal_length  sepal_width  petal_length  petal_width
0               1            1             1            1
1               1            1             1            1
2               1            1             1            1
3               1            1             1            1
4               1            1             1            1
..            ...          ...           ...          ...
145             1            1             1            1
146             1            1             1            1
147             1            1             1            1
148             1            1             1            1
149             1            1             1            1

[150 rows x 4 columns]

In [193]:
# 각 붓꽃별로 가장 큰 값과 가장 작은 값의 비율을 조회

def peak_to_peak(x):
    return x.max()/x.min()

####################################

print(iris.groupby(iris.species).apply(peak_to_peak))
print('----------------------------------------------------')
print(iris.groupby(iris.species).agg(peak_to_peak))
print('----------------------------------------------------')
print(iris.groupby(iris.species).transform(peak_to_peak))

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714
----------------------------------------------------
            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714
----------------------------------------------------
     sepal_length  sepal_width  petal_length  petal_width
0        1.348837     1.913043      1.900000     6.000000
1        1.348837     1.913043      1.900000     6.000000
2        1.348837     1.913043      1.900000     6.000000
3        1.348837     1.913043      1.900000     6.000000
4        1.348837     1.913043      1.900000     6.000000
..            ...          ...           ...          ...
145      1.612245     1.727273      1.533333     1.785714
146      1.612245     1.727273      1.533333     1.785714
147      1.612245     1.727273      1.533333     1.785714
148      1.612245     1.727273      1.533333     1.785714
149      1.612245     1.727273      1.533333     1.785714

[150 rows x 4 columns]

In [197]:
# 각 붓꽃별로 가장 꽃입 길이가 작은것 3개만 조회

def min3(x):
    return x.sort_values(by='petal_length')[:3]

#####################################
print(iris.groupby(iris.species).apply(min3))
print('---------------------------------------------')
print(iris.groupby(iris.species).add(min3))

                sepal_length  sepal_width  petal_length  petal_width  \
species
setosa     22            4.6          3.6           1.0          0.2
           13            4.3          3.0           1.1          0.1
           14            5.8          4.0           1.2          0.2
versicolor 98            5.1          2.5           3.0          1.1
           93            5.0          2.3           3.3          1.0
           57            4.9          2.4           3.3          1.0
virginica  106           4.9          2.5           4.5          1.7
           126           6.2          2.8           4.8          1.8
           138           6.0          3.0           4.8          1.8

                   species
species
setosa     22       setosa
           13       setosa
           14       setosa
versicolor 98   versicolor
           93   versicolor
           57   versicolor
virginica  106   virginica
           126   virginica
           138   virginica
---------------------------------------------

AttributeError: 'DataFrameGroupBy' object has no attribute 'add'

In [199]:
iris.groupby('species').agg([np.sum,np.mean,np.std,peak_to_peak])

           sepal_length                               sepal_width         \
                    sum   mean       std peak_to_peak         sum   mean
species
setosa            250.3  5.006  0.352490     1.348837       171.4  3.428
versicolor        296.8  5.936  0.516171     1.428571       138.5  2.770
virginica         329.4  6.588  0.635880     1.612245       148.7  2.974

                                  petal_length                                \
                 std peak_to_peak          sum   mean       std peak_to_peak
species
setosa      0.379064     1.913043         73.1  1.462  0.173664     1.900000
versicolor  0.313798     1.700000        213.0  4.260  0.469911     1.700000
virginica   0.322497     1.727273        277.6  5.552  0.551895     1.533333

           petal_width
                   sum   mean       std peak_to_peak
species
setosa            12.3  0.246  0.105386     6.000000
versicolor        66.3  1.326  0.197753     1.800000
virginica        101.3  2.026  0.274650     1.785714

In [203]:
def func_qcut(x):
    return pd.qcut(x,3,labels=['대','중','소'])

#####################################################

iris['petal_length_class']=iris.groupby(by='species')['petal_length'].apply(func_qcut)
iris.head()

,sepal_length,sepal_width,petal_length,petal_width,species,petal_length_class
0,5.1,3.5,1.4,0.2,setosa,대
1,4.9,3.0,1.4,0.2,setosa,대
2,4.7,3.2,1.3,0.2,setosa,대
3,4.6,3.1,1.5,0.2,setosa,중
4,5.0,3.6,1.4,0.2,setosa,대

In [218]:
##### 연습 문제

df = pd.DataFrame({
    'city': ['부산', '부산', '부산', '부산', '서울', '서울', '서울'],
    'fruits': ['apple', 'orange', 'banana', 'banana', 'apple', 'apple', 'banana'],
    'price': [100, 200, 250, 300, 150, 200, 400],
    'quantity': [1, 2, 3, 4, 5, 6, 7]
})

print(df)

print('-----------------------------------')

# 1) 도시별로 과일의 가격 평균과 수량 평균울 구하시오.
print(df.groupby('city').mean())

# 2) 도시별, 과일별, 가격평균과 수량 평균을 구하시오.
print(df.groupby(['city','fruits']).mean())

# 3) 위의 문제에서 도시별, 과일별을 인덱스로 하고싶지 않은 경우
print(df.groupby(['city','fruits'], as_index=False).mean())

# 4) 도시별로 가격의 평균과 수량의 합계를 동시에 구하시오.
print(df.groupby('city').agg([np.mean,np.sum]))

  city  fruits  price  quantity
0   부산   apple    100         1
1   부산  orange    200         2
2   부산  banana    250         3
3   부산  banana    300         4
4   서울   apple    150         5
5   서울   apple    200         6
6   서울  banana    400         7
-----------------------------------
      price  quantity
city
부산    212.5       2.5
서울    250.0       6.0
             price  quantity
city fruits
부산   apple   100.0       1.0
     banana  275.0       3.5
     orange  200.0       2.0
서울   apple   175.0       5.5
     banana  400.0       7.0
  city  fruits  price  quantity
0   부산   apple  100.0       1.0
1   부산  banana  275.0       3.5
2   부산  orange  200.0       2.0
3   서울   apple  175.0       5.5
4   서울  banana  400.0       7.0
      price      quantity
       mean  sum     mean sum
city
부산    212.5  850      2.5  10
서울    250.0  750      6.0  18

#### pivot_table()

+ values : 분석할 데이터 프레임에서 분석할 열
+ aggfunc : 분석할 메서드
+ fill_value : nan 대체값
+ dropna : nan에 해당하는 값을 버릴지 여부
+ margins : 행과 열 끝에 소계 추가

In [2]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}

df = pd.DataFrame(data)
df

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [227]:
##### 각 도시애서 연도별로 인구 수를 알고싶다

df.pivot('도시','연도','인구')
df.groupby(['도시','연도'])[['인구']].sum().unstack('연도')
df.pivot_table(values='인구', index='도시', columns='연도')
pd.pivot_table(df,'인구','도시','연도')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [9]:
#pd.pivot_table(df,'인구','부산','2005')
pd.pivot_table(df,'인구','도시','연도')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [235]:
##### 연도별, 도시별로 인구 수를 알고싶다.

print(df.pivot_table('인구',['연도','도시']))
df.groupby(['연도','도시'])[['인구']].sum()

              인구
연도   도시
2005 부산  3512547
     서울  9762546
2010 부산  3393191
     서울  9631482
     인천   263203
2015 부산  3448737
     서울  9904312
     인천  2890451

              인구
연도   도시
2005 부산  3512547
     서울  9762546
2010 부산  3393191
     서울  9631482
     인천   263203
2015 부산  3448737
     서울  9904312
     인천  2890451

In [245]:
##### 각 도시에서 연도별로 인구수를 알고싶다.
df.pivot_table('인구','도시','연도', aggfunc='sum', margins=True, margins_name='합계',fill_value=0)

연도      2005      2010      2015        합계
도시
부산   3512547   3393191   3448737  10354475
서울   9762546   9631482   9904312  29298340
인천         0    263203   2890451   3153654
합계  13275093  13287876  16243500  42806469

In [243]:
df.pivot_table('인구','도시','연도', aggfunc='sum')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

### 7. 활용예제

#### 1) 데이터 준비

In [248]:
import seaborn as sns

tips = sns.load_dataset('tips')
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [249]:
##### 식사 대금과 팀의 비율(tip/total_bill)을 나타내는 tip_pct라는 파생변수 추가

In [250]:
##### 성별로 인원수 파악

In [251]:
##### 성별,흡연유뮤별로 인원수 파악

In [252]:
##### 위의 두 정보를 하나의 테이블로 조회(pivot_table 사용)
'''
smoker    yes    no
   sex
  Male    ....
Female    ....
'''

'\nsmoker    yes    no\n   sex\n  Male    ....\nFemale    ....\n'

In [253]:
##### 성별에 따른 평균 팁 비율

In [254]:
##### 흡연 여부에 따른 팁 비율

In [255]:
##### 팁의 비율이 요일과 점심/저녁 여부, 인원수에 어떤 영향을 받는 지 살펴보기
# 어떤 요인이 가장 크게 작용하는지 확인

In [256]:
##### 성별, 흡연 유무별로 가장 많은 팁과 가장 적은 팁의 차이

#### 2) 데이터 준비

In [259]:
titanic = sns.load_dataset('titanic')
titanic.count()
titanic.head

<bound method NDFrame.head of      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]>

In [260]:
##### 나이대별 클래스를 만들어서 파생변수로 추가(age_class)
# 1, 20, 60, 100 으로 3등분 해서 미성년, 성년, 노년으로 분류

In [261]:
##### 성별, 나이대별, 객실별로 생존 여부의 평균값 조회

### 8. 시계열 데이터
+ DataTimeIndex 자료형
    - pd.to_datatime() : 문자열을 날짜 타입으로 변환
    - pd.date_range(): 특정 범위의 날짜 인덱스 생성

In [264]:
date_str = ['2021.1.1','2021.1.4','2021.1.6','2021.1.9']

idx = pd.to_datetime(date_str)
idx

DatetimeIndex(['2021-01-01', '2021-01-04', '2021-01-06', '2021-01-09'], dtype='datetime64[ns]', freq=None)

In [266]:
# 날짜를 인덱스 활용

np.random.seed(0)

s = pd.Series(np.random.randn(4), index=idx)
s

2021-01-01    1.764052
2021-01-04    0.400157
2021-01-06    0.978738
2021-01-09    2.240893
dtype: float64

In [269]:
# 날짜 데이터 생성
pd.date_range('2021-1-1','2021-4-30')
pd.date_range('2021-1-1',periods=50)

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19'],
              dtype='datetime64[ns]', freq='D')

In [270]:
"""
freq
    S : 초
    T : 분
    H : 시간
    D : 일
    B : 주말이 아닌 평일
    W : 주(일요일)
    W-MON : 주(월요일)
    M : 각 달의 마지막 날
    MS : 각 달의 첫날
    BM : 주말이 아닌 평일중에서 각 달의 마지막 날
    BMS : 주말이 아닌 평일중에서 각 달의 첫날
    WOM-2THU : 각 달의 두번째 목요일
    Q-JAN : 각 분기의 첫 달의 마지막 날
    Q-DEC : 각 분기의 마지막 달의 마지막 날
"""

'\nfreq\n    S : 초\n    T : 분\n    H : 시간\n    D : 일\n    B : 주말이 아닌 평일\n    W : 주(일요일)\n    W-MON : 주(월요일)\n    M : 각 달의 마지막 날\n    MS : 각 달의 첫날\n    BM : 주말이 아닌 평일중에서 각 달의 마지막 날\n    BMS : 주말이 아닌 평일중에서 각 달의 첫날\n    WOM-2THU : 각 달의 두번째 목요일\n    Q-JAN : 각 분기의 첫 달의 마지막 날\n    Q-DEC : 각 분기의 마지막 달의 마지막 날\n'

In [271]:
pd.date_range('2021-1-1','2021-1-31',freq='B')

DatetimeIndex(['2021-01-01', '2021-01-04', '2021-01-05', '2021-01-06',
               '2021-01-07', '2021-01-08', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-18',
               '2021-01-19', '2021-01-20', '2021-01-21', '2021-01-22',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29'],
              dtype='datetime64[ns]', freq='B')

In [277]:
##### shift 연산

np.random.seed(0)
ts = pd.Series(np.random.randn(4), index=pd.date_range('2021-1-1',periods=4,freq='M'))
print(ts)

print('---------------------------------------')

print(ts.shift(1))

print('---------------------------------------')

print(ts.shift(-1))

print('---------------------------------------')

print(ts.shift(1, freq='M'))

print('---------------------------------------')

print(ts.shift(1, freq='W'))

2021-01-31    1.764052
2021-02-28    0.400157
2021-03-31    0.978738
2021-04-30    2.240893
Freq: M, dtype: float64
---------------------------------------
2021-01-31         NaN
2021-02-28    1.764052
2021-03-31    0.400157
2021-04-30    0.978738
Freq: M, dtype: float64
---------------------------------------
2021-01-31    0.400157
2021-02-28    0.978738
2021-03-31    2.240893
2021-04-30         NaN
Freq: M, dtype: float64
---------------------------------------
2021-02-28    1.764052
2021-03-31    0.400157
2021-04-30    0.978738
2021-05-31    2.240893
Freq: M, dtype: float64
---------------------------------------
2021-02-07    1.764052
2021-03-07    0.400157
2021-04-04    0.978738
2021-05-02    2.240893
dtype: float64

In [283]:
##### resampling : 시간 간격을 다시 재조정
##### 시간 구간이 작아지면서 데이터 양이 증가 : 업샘플링
##### 시간 구간이 커지면서 데이터 양이 감소 : 다운 샘플링

ts = pd.Series(np.random.randn(100), index=pd.date_range('2021-1-1',periods=100,freq='D'))
ts.tail(10)

# 다운 샘플링 : 데이터가 그룹으로 묶이기 때문에 집계연산을 해서 대표값을 구해야 한다.
print(ts.resample('W').sum())

print('--------------------------------')

print(ts.resample('M').mean())

print('--------------------------------')

ts = pd.Series(np.random.randn(60), index = pd.date_range('2021-1-1', periods = 60,freq='T'))
ts
print(ts.resample('10T').sum())

2021-01-03   -0.177730
2021-01-10    0.581468
2021-01-17   -2.647696
2021-01-24   -1.811240
2021-01-31   -3.407975
2021-02-07   -2.549385
2021-02-14   -4.358327
2021-02-21   -1.651217
2021-02-28    0.402645
2021-03-07   -0.106829
2021-03-14   -1.677394
2021-03-21    3.748179
2021-03-28    0.672236
2021-04-04   -2.193744
2021-04-11   -2.961744
Freq: W-SUN, dtype: float64
--------------------------------
2021-01-31   -0.240747
2021-02-28   -0.291296
2021-03-31    0.037187
2021-04-30   -0.367209
Freq: M, dtype: float64
--------------------------------
2021-01-01 00:00:00   -6.957855
2021-01-01 00:10:00    4.665502
2021-01-01 00:20:00   -2.640369
2021-01-01 00:30:00   -1.652450
2021-01-01 00:40:00    3.733230
2021-01-01 00:50:00   -0.670456
Freq: 10T, dtype: float64

In [289]:
##### up-sampling
##### forward filling : 앞에서 나온 데이터를 그대로 사용
##### backward filling : 뒤에서 나온 데이터를 앞에서 미리 사용

print(ts.head(10))
print('----------------------------------')
print(ts.resample('30s').ffill().head(10))
print('----------------------------------')
print(ts.resample('30s').bfill().head(10))

2021-01-01 00:00:00   -0.448165
2021-01-01 00:01:00   -0.649338
2021-01-01 00:02:00   -0.023423
2021-01-01 00:03:00    1.079195
2021-01-01 00:04:00   -2.004216
2021-01-01 00:05:00    0.376877
2021-01-01 00:06:00   -0.545712
2021-01-01 00:07:00   -1.884586
2021-01-01 00:08:00   -1.945703
2021-01-01 00:09:00   -0.912783
Freq: T, dtype: float64
----------------------------------
2021-01-01 00:00:00   -0.448165
2021-01-01 00:00:30   -0.448165
2021-01-01 00:01:00   -0.649338
2021-01-01 00:01:30   -0.649338
2021-01-01 00:02:00   -0.023423
2021-01-01 00:02:30   -0.023423
2021-01-01 00:03:00    1.079195
2021-01-01 00:03:30    1.079195
2021-01-01 00:04:00   -2.004216
2021-01-01 00:04:30   -2.004216
Freq: 30S, dtype: float64
----------------------------------
2021-01-01 00:00:00   -0.448165
2021-01-01 00:00:30   -0.649338
2021-01-01 00:01:00   -0.649338
2021-01-01 00:01:30   -0.023423
2021-01-01 00:02:00   -0.023423
2021-01-01 00:02:30    1.079195
2021-01-01 00:03:00    1.079195
2021-01-01 00:03:30   -2.004216
2021-01-01 00:04:00   -2.004216
2021-01-01 00:04:30    0.376877
Freq: 30S, dtype: float64